package ru.nsu.p2p.common.event;

/**
 * Представляет собой активную подписку на события ядра.
 * Возвращается методом {@link ru.nsu.p2p.common.api.ClientEvents#subscribe(ClientEventListener)}.
 *
 * Реализует механизм защиты от утечек памяти (Memory Leaks).
 */
public interface Subscription {

    /**
     * Отменяет подписку. Ядро удаляет слушателя из своего внутреннего списка и больше
     * не вызывает его методы.
     *
     * Этот метод ОБЯЗАТЕЛЬНО нужно вызывать при закрытии UI-компонента (например, окна или вкладки),
     * который был подписан на события. Иначе сборщик мусора (GC) не сможет удалить UI-компонент из памяти.
     */
    void close();

}
