package ru.nsu.p2p.common.stream;

/**
 * Жизненный цикл стриминга файла.
 * Используется для отображения статуса в UI (например, крутилки "Буферизация...").
 */
public enum StreamState {
    BUFFERING,         // Идет скачивание первых чанков, необходимых для начала воспроизведения.
    READY,             // Данных достаточно, плеер может играть видео.
    WAITING_FOR_PEERS, // Воспроизведение догнало скачивание, а пиров нет. Стрим "заикается".
    FAILED,            // Критическая ошибка (например, все пиры отдали неверные хеши).
    CLOSED             // Стрим остановлен пользователем.
}