package ru.nsu.p2p.common.protocol.core;

/**
 * Глобальный реестр всех типов сообщений в нашем P2P-протоколе.
 * Передается в заголовке (MessageHeader) в виде 1 байта.
 * Позволяет принимающей стороне (MessageCodec) понять, в какой именно Java-класс
 * нужно десериализовать входящий массив байтов.
 */
public enum MessageType {
    // === Взаимодействие Клиент <-> Трекер ===

    TRACKER_REGISTER_REQ,  // Клиент сообщает Трекеру свой IP и порт для приема входящих соединений.
    TRACKER_REGISTER_RES,  // Трекер подтверждает регистрацию и выдает интервал для Heartbeat.
    TRACKER_HEARTBEAT_REQ, // Клиент сообщает Трекеру, что он жив, и передает список раздаваемых файлов.
    TRACKER_PUBLISH_REQ,   // Клиент публикует новый файл (отправляет FileManifest).
    TRACKER_CATALOG_REQ,   // Клиент запрашивает страницу каталога (поиск).
    TRACKER_CATALOG_RES,   // Трекер возвращает результаты поиска (CatalogPage).
    TRACKER_GET_PEERS_REQ, // Клиент запрашивает список пиров для конкретного файла.
    TRACKER_GET_PEERS_RES, // Трекер возвращает список пиров (PeerList).
    TRACKER_ERROR_RES,     // Трекер сообщает об ошибке (например, неверный запрос).

    // === Взаимодействие Пир <-> Пир (P2P) ===

    PEER_HANDSHAKE,        // Первое сообщение после установки TCP-соединения. Пиры сверяют fileId.
    PEER_BITFIELD,         // Обмен битовыми масками: пир сообщает, какие чанки у него есть.
    PEER_CHUNK_REQ,        // Запрос конкретного чанка по его индексу.
    PEER_CHUNK_PAYLOAD     // Ответ с сырыми байтами запрошенного чанка.
}